#include <stdio.h>
#include <stdlib.h>
#include <time.h>

#define N 10

int main() {
    int a[N];
    int i, count = 0;
    srand(time(NULL));  // ініціалізуємо генератор випадкових чисел

    // заповнюємо масив випадковими числами
    for (i = 0; i < N; i++) {
        a[i] = rand() % 201 - 100;  // генеруємо випадкове число з відрізка [-100; 100]
        printf("%d ", a[i]);  // виводимо елементи масиву
        if (a[i] > 5) {  // перевіряємо, чи елемент більший за число 5
            count++;  // якщо так, збільшуємо лічильник
        }
    }
    printf("\n");

    printf("Кількість елементів масиву, більших за число 5: %d\n", count);

    return 0;
}
